In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
                  'Order_ID': [101, 102, 103, 104, 105],
                  'Customer_Name': ['Alice', 'Bob', 'Charlie', None, 'Eve'],
                  'Product': ['Laptop', 'Keyboard', 'Monitor', 'Mouse', None],
                  'Quantity': [1, 2, np.nan, 4, 5],
                  'Price': [1000, 500, np.nan, 200, 300]
              })

df

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor       NaN     NaN
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [4]:
df.isnull()
df.isnull().sum()

Order_ID         0
Customer_Name    1
Product          1
Quantity         1
Price            1
dtype: int64

In [9]:
df.dropna()
df.dropna(axis=1)
df.drop(columns="Customer_Name")

   Order_ID   Product  Quantity   Price
0       101    Laptop       1.0  1000.0
1       102  Keyboard       2.0   500.0
2       103   Monitor       NaN     NaN
3       104     Mouse       4.0   200.0
4       105      None       5.0   300.0

In [13]:
df.fillna(5)
df["Quantity"].fillna(df["Quantity"].mean())
df["Quantity"].ffill()
df["Quantity"].bfill()

0    1.0
1    2.0
2    4.0
3    4.0
4    5.0
Name: Quantity, dtype: float64

In [14]:
df["Quantity"].interpolate()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: Quantity, dtype: float64

In [16]:
df

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor       NaN     NaN
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [19]:
df2 = pd.read_csv("https://raw.githubusercontent.com/FTDS-learning-materials/phase-0/main/src/teams.csv")
df2.duplicated().sum()
df

   Order_ID Customer_Name   Product  Quantity   Price
0       101         Alice    Laptop       1.0  1000.0
1       102           Bob  Keyboard       2.0   500.0
2       103       Charlie   Monitor       NaN     NaN
3       104          None     Mouse       4.0   200.0
4       105           Eve      None       5.0   300.0

In [29]:
df3 = pd.DataFrame({
    'Order_ID': [101, 102, 103, 103, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Monitor', 'Mouse'],
    'Quantity': [1, 2, 4, 4, 5],
    'Price': [1000, 500, 200, 200, 300]
})
df3.duplicated()
df3.drop_duplicates(keep="first")
df3.drop_duplicates(keep="last")
df3.drop_duplicates(keep=False)
df3.drop_duplicates(keep=False, ignore_index=True)
df4 = pd.DataFrame({
    'Order_ID': [101, 102, 103, 103, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Monitor', 'Mouse'],
    'Quantity': [1, 2, 1, 1, 1],
    'Price': [1000, 500, 200, 200, 300]
})

df4.drop_duplicates(subset="Quantity")

   Order_ID Customer_Name   Product  Quantity  Price
0       101         Alice    Laptop         1   1000
1       102           Bob  Keyboard         2    500

In [36]:
df5 = pd.DataFrame({
    'Order_ID': [101, 102, 103, 103, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['Laptop', 'Keyboard', 'Monitor', 'Monitor', 'Mouse'],
    'Quantity': [1, 2, 4, 4, 5],
    'Price': ["$1000", "$500-", "$200+", "$200", "$300"]
})

df5["Price"] = df5["Price"].str.replace("$", "")
df5["Price"] = df5["Price"].str.replace("+", "")
df5["Price"] = df5["Price"].str.replace("-", "")
df5["Price"] = df5["Price"].astype(int)
df5.dtypes

Order_ID          int64
Customer_Name    object
Product          object
Quantity          int64
Price             int64
dtype: object

In [52]:
df6 = pd.DataFrame({
    'Order_ID': [101, 102, 103, 103, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['     Laptop    ', '   Keyboard        ', '   Monitor   ', '  Monitor  ', '      Mouse     '],
    'Quantity': [1, 2, 4, 4, 5],
    'Price': ["$1000", "$500-", "$200+", "$200", "$300"]
})

print(df6)
df6["Product"].str.strip()
df6["Product"].str.title()
df6["Product"].str.lower()
df6["Product"].str.upper()

   Order_ID Customer_Name              Product  Quantity  Price
0       101         Alice           Laptop             1  $1000
1       102           Bob     Keyboard                 2  $500-
2       103       Charlie           Monitor            4  $200+
3       103       Charlie            Monitor           4   $200
4       105           Eve           Mouse              5   $300

0             Laptop
1       Keyboard
2             Monitor
3              Monitor
4             Mouse
Name: Product, dtype: object

In [63]:
df7 = pd.DataFrame({
    'Order_ID': [101, 102, 103, 103, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['Laptop,Mousepad', 'Keyboard', 'Monitor', 'Monitor', ' Mouse'],
    'Quantity': [1, 2, 4, 4, 5],
    'Price': ["$1000", "$500-", "$200+", "$200", "$300"]
})

df8 = df7.copy()

df8["Product"] = df7["Product"].str.split(",")
df8.iloc[0]["Product"]

'Laptop'

In [66]:
df9 = pd.DataFrame({
    'Order_ID': [101, 102, 103, 103, 105],
    'Customer_Name': ['Alice', 'Bob', 'Charlie', 'Charlie', 'Eve'],
    'Product': ['Laptop,Mousepad', 'Keyboard', 'Monitor', 'Monitor', ' Mouse'],
    'Quantity': [1, 2, 4, 4, 5],
    'Price': ["$1000", "$500-", "$200+", "$200", "$300"],
    'Order_date': ['2024-01-01', '2024-02-20', '2024-02-15', '2024-01-16', '2024-03-30']
})

df9["Order_date"] = pd.to_datetime(df9["Order_date"])
df9.info()
df9["Order_date"].dt.year

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_ID       5 non-null      int64
 1   Customer_Name  5 non-null      object
 2   Product        5 non-null      object
 3   Quantity       5 non-null      int64
 4   Price          5 non-null      object
 5   Order_date     5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 372.0+ bytes

0    2024
1    2024
2    2024
3    2024
4    2024
Name: Order_date, dtype: int32